; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l7-t1-p8---int100n150-m25---int100c110---s172---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level6 level6)
(sum level0 level7 level7)
(sum level0 level15 level15)
(sum level0 level20 level20)
(sum level0 level21 level21)
(sum level0 level22 level22)
(sum level0 level23 level23)
(sum level1 level1 level2)
(sum level1 level6 level7)
(sum level1 level7 level8)
(sum level1 level15 level16)
(sum level1 level20 level21)
(sum level1 level21 level22)
(sum level1 level22 level23)
(sum level1 level23 level24)
(sum level2 level1 level3)
(sum level2 level6 level8)
(sum level2 level7 level9)
(sum level2 level15 level17)
(sum level2 level20 level22)
(sum level2 level21 level23)
(sum level2 level22 level24)
(sum level2 level23 level25)
(sum level3 level1 level4)
(sum level3 level6 level9)
(sum level3 level7 level10)
(sum level3 level15 level18)
(sum level3 level20 level23)
(sum level3 level21 level24)
(sum level3 level22 level25)
(sum level3 level23 level26)
(sum level4 level1 level5)
(sum level4 level6 level10)
(sum level4 level7 level11)
(sum level4 level15 level19)
(sum level4 level20 level24)
(sum level4 level21 level25)
(sum level4 level22 level26)
(sum level4 level23 level27)
(sum level5 level1 level6)
(sum level5 level6 level11)
(sum level5 level7 level12)
(sum level5 level15 level20)
(sum level5 level20 level25)
(sum level5 level21 level26)
(sum level5 level22 level27)
(sum level5 level23 level28)
(sum level6 level1 level7)
(sum level6 level6 level12)
(sum level6 level7 level13)
(sum level6 level15 level21)
(sum level6 level20 level26)
(sum level6 level21 level27)
(sum level6 level22 level28)
(sum level6 level23 level29)
(sum level7 level1 level8)
(sum level7 level6 level13)
(sum level7 level7 level14)
(sum level7 level15 level22)
(sum level7 level20 level27)
(sum level7 level21 level28)
(sum level7 level22 level29)
(sum level7 level23 level30)
(sum level8 level1 level9)
(sum level8 level6 level14)
(sum level8 level7 level15)
(sum level8 level15 level23)
(sum level8 level20 level28)
(sum level8 level21 level29)
(sum level8 level22 level30)
(sum level8 level23 level31)
(sum level9 level1 level10)
(sum level9 level6 level15)
(sum level9 level7 level16)
(sum level9 level15 level24)
(sum level9 level20 level29)
(sum level9 level21 level30)
(sum level9 level22 level31)
(sum level9 level23 level32)
(sum level10 level1 level11)
(sum level10 level6 level16)
(sum level10 level7 level17)
(sum level10 level15 level25)
(sum level10 level20 level30)
(sum level10 level21 level31)
(sum level10 level22 level32)
(sum level10 level23 level33)
(sum level11 level1 level12)
(sum level11 level6 level17)
(sum level11 level7 level18)
(sum level11 level15 level26)
(sum level11 level20 level31)
(sum level11 level21 level32)
(sum level11 level22 level33)
(sum level11 level23 level34)
(sum level12 level1 level13)
(sum level12 level6 level18)
(sum level12 level7 level19)
(sum level12 level15 level27)
(sum level12 level20 level32)
(sum level12 level21 level33)
(sum level12 level22 level34)
(sum level12 level23 level35)
(sum level13 level1 level14)
(sum level13 level6 level19)
(sum level13 level7 level20)
(sum level13 level15 level28)
(sum level13 level20 level33)
(sum level13 level21 level34)
(sum level13 level22 level35)
(sum level13 level23 level36)
(sum level14 level1 level15)
(sum level14 level6 level20)
(sum level14 level7 level21)
(sum level14 level15 level29)
(sum level14 level20 level34)
(sum level14 level21 level35)
(sum level14 level22 level36)
(sum level14 level23 level37)
(sum level15 level1 level16)
(sum level15 level6 level21)
(sum level15 level7 level22)
(sum level15 level15 level30)
(sum level15 level20 level35)
(sum level15 level21 level36)
(sum level15 level22 level37)
(sum level15 level23 level38)
(sum level16 level1 level17)
(sum level16 level6 level22)
(sum level16 level7 level23)
(sum level16 level15 level31)
(sum level16 level20 level36)
(sum level16 level21 level37)
(sum level16 level22 level38)
(sum level16 level23 level39)
(sum level17 level1 level18)
(sum level17 level6 level23)
(sum level17 level7 level24)
(sum level17 level15 level32)
(sum level17 level20 level37)
(sum level17 level21 level38)
(sum level17 level22 level39)
(sum level17 level23 level40)
(sum level18 level1 level19)
(sum level18 level6 level24)
(sum level18 level7 level25)
(sum level18 level15 level33)
(sum level18 level20 level38)
(sum level18 level21 level39)
(sum level18 level22 level40)
(sum level18 level23 level41)
(sum level19 level1 level20)
(sum level19 level6 level25)
(sum level19 level7 level26)
(sum level19 level15 level34)
(sum level19 level20 level39)
(sum level19 level21 level40)
(sum level19 level22 level41)
(sum level19 level23 level42)
(sum level20 level1 level21)
(sum level20 level6 level26)
(sum level20 level7 level27)
(sum level20 level15 level35)
(sum level20 level20 level40)
(sum level20 level21 level41)
(sum level20 level22 level42)
(sum level20 level23 level43)
(sum level21 level1 level22)
(sum level21 level6 level27)
(sum level21 level7 level28)
(sum level21 level15 level36)
(sum level21 level20 level41)
(sum level21 level21 level42)
(sum level21 level22 level43)
(sum level21 level23 level44)
(sum level22 level1 level23)
(sum level22 level6 level28)
(sum level22 level7 level29)
(sum level22 level15 level37)
(sum level22 level20 level42)
(sum level22 level21 level43)
(sum level22 level22 level44)
(sum level22 level23 level45)
(sum level23 level1 level24)
(sum level23 level6 level29)
(sum level23 level7 level30)
(sum level23 level15 level38)
(sum level23 level20 level43)
(sum level23 level21 level44)
(sum level23 level22 level45)
(sum level23 level23 level46)
(sum level24 level1 level25)
(sum level24 level6 level30)
(sum level24 level7 level31)
(sum level24 level15 level39)
(sum level24 level20 level44)
(sum level24 level21 level45)
(sum level24 level22 level46)
(sum level24 level23 level47)
(sum level25 level1 level26)
(sum level25 level6 level31)
(sum level25 level7 level32)
(sum level25 level15 level40)
(sum level25 level20 level45)
(sum level25 level21 level46)
(sum level25 level22 level47)
(sum level25 level23 level48)
(sum level26 level1 level27)
(sum level26 level6 level32)
(sum level26 level7 level33)
(sum level26 level15 level41)
(sum level26 level20 level46)
(sum level26 level21 level47)
(sum level26 level22 level48)
(sum level26 level23 level49)
(sum level27 level1 level28)
(sum level27 level6 level33)
(sum level27 level7 level34)
(sum level27 level15 level42)
(sum level27 level20 level47)
(sum level27 level21 level48)
(sum level27 level22 level49)
(sum level27 level23 level50)
(sum level28 level1 level29)
(sum level28 level6 level34)
(sum level28 level7 level35)
(sum level28 level15 level43)
(sum level28 level20 level48)
(sum level28 level21 level49)
(sum level28 level22 level50)
(sum level28 level23 level51)
(sum level29 level1 level30)
(sum level29 level6 level35)
(sum level29 level7 level36)
(sum level29 level15 level44)
(sum level29 level20 level49)
(sum level29 level21 level50)
(sum level29 level22 level51)
(sum level29 level23 level52)
(sum level30 level1 level31)
(sum level30 level6 level36)
(sum level30 level7 level37)
(sum level30 level15 level45)
(sum level30 level20 level50)
(sum level30 level21 level51)
(sum level30 level22 level52)
(sum level30 level23 level53)
(sum level31 level1 level32)
(sum level31 level6 level37)
(sum level31 level7 level38)
(sum level31 level15 level46)
(sum level31 level20 level51)
(sum level31 level21 level52)
(sum level31 level22 level53)
(sum level31 level23 level54)
(sum level32 level1 level33)
(sum level32 level6 level38)
(sum level32 level7 level39)
(sum level32 level15 level47)
(sum level32 level20 level52)
(sum level32 level21 level53)
(sum level32 level22 level54)
(sum level32 level23 level55)
(sum level33 level1 level34)
(sum level33 level6 level39)
(sum level33 level7 level40)
(sum level33 level15 level48)
(sum level33 level20 level53)
(sum level33 level21 level54)
(sum level33 level22 level55)
(sum level33 level23 level56)
(sum level34 level1 level35)
(sum level34 level6 level40)
(sum level34 level7 level41)
(sum level34 level15 level49)
(sum level34 level20 level54)
(sum level34 level21 level55)
(sum level34 level22 level56)
(sum level34 level23 level57)
(sum level35 level1 level36)
(sum level35 level6 level41)
(sum level35 level7 level42)
(sum level35 level15 level50)
(sum level35 level20 level55)
(sum level35 level21 level56)
(sum level35 level22 level57)
(sum level35 level23 level58)
(sum level36 level1 level37)
(sum level36 level6 level42)
(sum level36 level7 level43)
(sum level36 level15 level51)
(sum level36 level20 level56)
(sum level36 level21 level57)
(sum level36 level22 level58)
(sum level36 level23 level59)
(sum level37 level1 level38)
(sum level37 level6 level43)
(sum level37 level7 level44)
(sum level37 level15 level52)
(sum level37 level20 level57)
(sum level37 level21 level58)
(sum level37 level22 level59)
(sum level37 level23 level60)
(sum level38 level1 level39)
(sum level38 level6 level44)
(sum level38 level7 level45)
(sum level38 level15 level53)
(sum level38 level20 level58)
(sum level38 level21 level59)
(sum level38 level22 level60)
(sum level38 level23 level61)
(sum level39 level1 level40)
(sum level39 level6 level45)
(sum level39 level7 level46)
(sum level39 level15 level54)
(sum level39 level20 level59)
(sum level39 level21 level60)
(sum level39 level22 level61)
(sum level39 level23 level62)
(sum level40 level1 level41)
(sum level40 level6 level46)
(sum level40 level7 level47)
(sum level40 level15 level55)
(sum level40 level20 level60)
(sum level40 level21 level61)
(sum level40 level22 level62)
(sum level40 level23 level63)
(sum level41 level1 level42)
(sum level41 level6 level47)
(sum level41 level7 level48)
(sum level41 level15 level56)
(sum level41 level20 level61)
(sum level41 level21 level62)
(sum level41 level22 level63)
(sum level41 level23 level64)
(sum level42 level1 level43)
(sum level42 level6 level48)
(sum level42 level7 level49)
(sum level42 level15 level57)
(sum level42 level20 level62)
(sum level42 level21 level63)
(sum level42 level22 level64)
(sum level42 level23 level65)
(sum level43 level1 level44)
(sum level43 level6 level49)
(sum level43 level7 level50)
(sum level43 level15 level58)
(sum level43 level20 level63)
(sum level43 level21 level64)
(sum level43 level22 level65)
(sum level43 level23 level66)
(sum level44 level1 level45)
(sum level44 level6 level50)
(sum level44 level7 level51)
(sum level44 level15 level59)
(sum level44 level20 level64)
(sum level44 level21 level65)
(sum level44 level22 level66)
(sum level44 level23 level67)
(sum level45 level1 level46)
(sum level45 level6 level51)
(sum level45 level7 level52)
(sum level45 level15 level60)
(sum level45 level20 level65)
(sum level45 level21 level66)
(sum level45 level22 level67)
(sum level45 level23 level68)
(sum level46 level1 level47)
(sum level46 level6 level52)
(sum level46 level7 level53)
(sum level46 level15 level61)
(sum level46 level20 level66)
(sum level46 level21 level67)
(sum level46 level22 level68)
(sum level46 level23 level69)
(sum level47 level1 level48)
(sum level47 level6 level53)
(sum level47 level7 level54)
(sum level47 level15 level62)
(sum level47 level20 level67)
(sum level47 level21 level68)
(sum level47 level22 level69)
(sum level47 level23 level70)
(sum level48 level1 level49)
(sum level48 level6 level54)
(sum level48 level7 level55)
(sum level48 level15 level63)
(sum level48 level20 level68)
(sum level48 level21 level69)
(sum level48 level22 level70)
(sum level48 level23 level71)
(sum level49 level1 level50)
(sum level49 level6 level55)
(sum level49 level7 level56)
(sum level49 level15 level64)
(sum level49 level20 level69)
(sum level49 level21 level70)
(sum level49 level22 level71)
(sum level49 level23 level72)
(sum level50 level1 level51)
(sum level50 level6 level56)
(sum level50 level7 level57)
(sum level50 level15 level65)
(sum level50 level20 level70)
(sum level50 level21 level71)
(sum level50 level22 level72)
(sum level50 level23 level73)
(sum level51 level1 level52)
(sum level51 level6 level57)
(sum level51 level7 level58)
(sum level51 level15 level66)
(sum level51 level20 level71)
(sum level51 level21 level72)
(sum level51 level22 level73)
(sum level51 level23 level74)
(sum level52 level1 level53)
(sum level52 level6 level58)
(sum level52 level7 level59)
(sum level52 level15 level67)
(sum level52 level20 level72)
(sum level52 level21 level73)
(sum level52 level22 level74)
(sum level52 level23 level75)
(sum level53 level1 level54)
(sum level53 level6 level59)
(sum level53 level7 level60)
(sum level53 level15 level68)
(sum level53 level20 level73)
(sum level53 level21 level74)
(sum level53 level22 level75)
(sum level53 level23 level76)
(sum level54 level1 level55)
(sum level54 level6 level60)
(sum level54 level7 level61)
(sum level54 level15 level69)
(sum level54 level20 level74)
(sum level54 level21 level75)
(sum level54 level22 level76)
(sum level54 level23 level77)
(sum level55 level1 level56)
(sum level55 level6 level61)
(sum level55 level7 level62)
(sum level55 level15 level70)
(sum level55 level20 level75)
(sum level55 level21 level76)
(sum level55 level22 level77)
(sum level55 level23 level78)
(sum level56 level1 level57)
(sum level56 level6 level62)
(sum level56 level7 level63)
(sum level56 level15 level71)
(sum level56 level20 level76)
(sum level56 level21 level77)
(sum level56 level22 level78)
(sum level56 level23 level79)
(sum level57 level1 level58)
(sum level57 level6 level63)
(sum level57 level7 level64)
(sum level57 level15 level72)
(sum level57 level20 level77)
(sum level57 level21 level78)
(sum level57 level22 level79)
(sum level57 level23 level80)
(sum level58 level1 level59)
(sum level58 level6 level64)
(sum level58 level7 level65)
(sum level58 level15 level73)
(sum level58 level20 level78)
(sum level58 level21 level79)
(sum level58 level22 level80)
(sum level58 level23 level81)
(sum level59 level1 level60)
(sum level59 level6 level65)
(sum level59 level7 level66)
(sum level59 level15 level74)
(sum level59 level20 level79)
(sum level59 level21 level80)
(sum level59 level22 level81)
(sum level59 level23 level82)
(sum level60 level1 level61)
(sum level60 level6 level66)
(sum level60 level7 level67)
(sum level60 level15 level75)
(sum level60 level20 level80)
(sum level60 level21 level81)
(sum level60 level22 level82)
(sum level60 level23 level83)
(sum level61 level1 level62)
(sum level61 level6 level67)
(sum level61 level7 level68)
(sum level61 level15 level76)
(sum level61 level20 level81)
(sum level61 level21 level82)
(sum level61 level22 level83)
(sum level61 level23 level84)
(sum level62 level1 level63)
(sum level62 level6 level68)
(sum level62 level7 level69)
(sum level62 level15 level77)
(sum level62 level20 level82)
(sum level62 level21 level83)
(sum level62 level22 level84)
(sum level62 level23 level85)
(sum level63 level1 level64)
(sum level63 level6 level69)
(sum level63 level7 level70)
(sum level63 level15 level78)
(sum level63 level20 level83)
(sum level63 level21 level84)
(sum level63 level22 level85)
(sum level63 level23 level86)
(sum level64 level1 level65)
(sum level64 level6 level70)
(sum level64 level7 level71)
(sum level64 level15 level79)
(sum level64 level20 level84)
(sum level64 level21 level85)
(sum level64 level22 level86)
(sum level64 level23 level87)
(sum level65 level1 level66)
(sum level65 level6 level71)
(sum level65 level7 level72)
(sum level65 level15 level80)
(sum level65 level20 level85)
(sum level65 level21 level86)
(sum level65 level22 level87)
(sum level65 level23 level88)
(sum level66 level1 level67)
(sum level66 level6 level72)
(sum level66 level7 level73)
(sum level66 level15 level81)
(sum level66 level20 level86)
(sum level66 level21 level87)
(sum level66 level22 level88)
(sum level66 level23 level89)
(sum level67 level1 level68)
(sum level67 level6 level73)
(sum level67 level7 level74)
(sum level67 level15 level82)
(sum level67 level20 level87)
(sum level67 level21 level88)
(sum level67 level22 level89)
(sum level67 level23 level90)
(sum level68 level1 level69)
(sum level68 level6 level74)
(sum level68 level7 level75)
(sum level68 level15 level83)
(sum level68 level20 level88)
(sum level68 level21 level89)
(sum level68 level22 level90)
(sum level68 level23 level91)
(sum level69 level1 level70)
(sum level69 level6 level75)
(sum level69 level7 level76)
(sum level69 level15 level84)
(sum level69 level20 level89)
(sum level69 level21 level90)
(sum level69 level22 level91)
(sum level69 level23 level92)
(sum level70 level1 level71)
(sum level70 level6 level76)
(sum level70 level7 level77)
(sum level70 level15 level85)
(sum level70 level20 level90)
(sum level70 level21 level91)
(sum level70 level22 level92)
(sum level70 level23 level93)
(sum level71 level1 level72)
(sum level71 level6 level77)
(sum level71 level7 level78)
(sum level71 level15 level86)
(sum level71 level20 level91)
(sum level71 level21 level92)
(sum level71 level22 level93)
(sum level71 level23 level94)
(sum level72 level1 level73)
(sum level72 level6 level78)
(sum level72 level7 level79)
(sum level72 level15 level87)
(sum level72 level20 level92)
(sum level72 level21 level93)
(sum level72 level22 level94)
(sum level72 level23 level95)
(sum level73 level1 level74)
(sum level73 level6 level79)
(sum level73 level7 level80)
(sum level73 level15 level88)
(sum level73 level20 level93)
(sum level73 level21 level94)
(sum level73 level22 level95)
(sum level73 level23 level96)
(sum level74 level1 level75)
(sum level74 level6 level80)
(sum level74 level7 level81)
(sum level74 level15 level89)
(sum level74 level20 level94)
(sum level74 level21 level95)
(sum level74 level22 level96)
(sum level74 level23 level97)
(sum level75 level1 level76)
(sum level75 level6 level81)
(sum level75 level7 level82)
(sum level75 level15 level90)
(sum level75 level20 level95)
(sum level75 level21 level96)
(sum level75 level22 level97)
(sum level75 level23 level98)
(sum level76 level1 level77)
(sum level76 level6 level82)
(sum level76 level7 level83)
(sum level76 level15 level91)
(sum level76 level20 level96)
(sum level76 level21 level97)
(sum level76 level22 level98)
(sum level76 level23 level99)
(sum level77 level1 level78)
(sum level77 level6 level83)
(sum level77 level7 level84)
(sum level77 level15 level92)
(sum level77 level20 level97)
(sum level77 level21 level98)
(sum level77 level22 level99)
(sum level77 level23 level100)
(sum level78 level1 level79)
(sum level78 level6 level84)
(sum level78 level7 level85)
(sum level78 level15 level93)
(sum level78 level20 level98)
(sum level78 level21 level99)
(sum level78 level22 level100)
(sum level78 level23 level101)
(sum level79 level1 level80)
(sum level79 level6 level85)
(sum level79 level7 level86)
(sum level79 level15 level94)
(sum level79 level20 level99)
(sum level79 level21 level100)
(sum level79 level22 level101)
(sum level79 level23 level102)
(sum level80 level1 level81)
(sum level80 level6 level86)
(sum level80 level7 level87)
(sum level80 level15 level95)
(sum level80 level20 level100)
(sum level80 level21 level101)
(sum level80 level22 level102)
(sum level80 level23 level103)
(sum level81 level1 level82)
(sum level81 level6 level87)
(sum level81 level7 level88)
(sum level81 level15 level96)
(sum level81 level20 level101)
(sum level81 level21 level102)
(sum level81 level22 level103)
(sum level81 level23 level104)
(sum level82 level1 level83)
(sum level82 level6 level88)
(sum level82 level7 level89)
(sum level82 level15 level97)
(sum level82 level20 level102)
(sum level82 level21 level103)
(sum level82 level22 level104)
(sum level82 level23 level105)
(sum level83 level1 level84)
(sum level83 level6 level89)
(sum level83 level7 level90)
(sum level83 level15 level98)
(sum level83 level20 level103)
(sum level83 level21 level104)
(sum level83 level22 level105)
(sum level83 level23 level106)
(sum level84 level1 level85)
(sum level84 level6 level90)
(sum level84 level7 level91)
(sum level84 level15 level99)
(sum level84 level20 level104)
(sum level84 level21 level105)
(sum level84 level22 level106)
(sum level84 level23 level107)
(sum level85 level1 level86)
(sum level85 level6 level91)
(sum level85 level7 level92)
(sum level85 level15 level100)
(sum level85 level20 level105)
(sum level85 level21 level106)
(sum level85 level22 level107)
(sum level85 level23 level108)
(sum level86 level1 level87)
(sum level86 level6 level92)
(sum level86 level7 level93)
(sum level86 level15 level101)
(sum level86 level20 level106)
(sum level86 level21 level107)
(sum level86 level22 level108)
(sum level87 level1 level88)
(sum level87 level6 level93)
(sum level87 level7 level94)
(sum level87 level15 level102)
(sum level87 level20 level107)
(sum level87 level21 level108)
(sum level88 level1 level89)
(sum level88 level6 level94)
(sum level88 level7 level95)
(sum level88 level15 level103)
(sum level88 level20 level108)
(sum level89 level1 level90)
(sum level89 level6 level95)
(sum level89 level7 level96)
(sum level89 level15 level104)
(sum level90 level1 level91)
(sum level90 level6 level96)
(sum level90 level7 level97)
(sum level90 level15 level105)
(sum level91 level1 level92)
(sum level91 level6 level97)
(sum level91 level7 level98)
(sum level91 level15 level106)
(sum level92 level1 level93)
(sum level92 level6 level98)
(sum level92 level7 level99)
(sum level92 level15 level107)
(sum level93 level1 level94)
(sum level93 level6 level99)
(sum level93 level7 level100)
(sum level93 level15 level108)
(sum level94 level1 level95)
(sum level94 level6 level100)
(sum level94 level7 level101)
(sum level95 level1 level96)
(sum level95 level6 level101)
(sum level95 level7 level102)
(sum level96 level1 level97)
(sum level96 level6 level102)
(sum level96 level7 level103)
(sum level97 level1 level98)
(sum level97 level6 level103)
(sum level97 level7 level104)
(sum level98 level1 level99)
(sum level98 level6 level104)
(sum level98 level7 level105)
(sum level99 level1 level100)
(sum level99 level6 level105)
(sum level99 level7 level106)
(sum level100 level1 level101)
(sum level100 level6 level106)
(sum level100 level7 level107)
(sum level101 level1 level102)
(sum level101 level6 level107)
(sum level101 level7 level108)
(sum level102 level1 level103)
(sum level102 level6 level108)
(sum level103 level1 level104)
(sum level104 level1 level105)
(sum level105 level1 level106)
(sum level106 level1 level107)
(sum level107 level1 level108)

(connected l0 l1)
(fuelcost level15 l0 l1)
(connected l0 l2)
(fuelcost level21 l0 l2)
(connected l0 l3)
(fuelcost level7 l0 l3)
(connected l1 l0)
(fuelcost level15 l1 l0)
(connected l1 l3)
(fuelcost level23 l1 l3)
(connected l1 l4)
(fuelcost level6 l1 l4)
(connected l2 l0)
(fuelcost level21 l2 l0)
(connected l2 l3)
(fuelcost level22 l2 l3)
(connected l2 l5)
(fuelcost level1 l2 l5)
(connected l2 l6)
(fuelcost level1 l2 l6)
(connected l3 l0)
(fuelcost level7 l3 l0)
(connected l3 l1)
(fuelcost level23 l3 l1)
(connected l3 l2)
(fuelcost level22 l3 l2)
(connected l3 l4)
(fuelcost level23 l3 l4)
(connected l3 l5)
(fuelcost level20 l3 l5)
(connected l4 l1)
(fuelcost level6 l4 l1)
(connected l4 l3)
(fuelcost level23 l4 l3)
(connected l5 l2)
(fuelcost level1 l5 l2)
(connected l5 l3)
(fuelcost level20 l5 l3)
(connected l6 l2)
(fuelcost level1 l6 l2)

(at t0 l1)
(fuel t0 level108)
(= (total-cost) 0)

(at p0 l6)
(at p1 l2)
(at p2 l5)
(at p3 l3)
(at p4 l3)
(at p5 l0)
(at p6 l5)
(at p7 l4)
)

(:goal
(and
(at p0 l1)
(at p1 l4)
(at p2 l1)
(at p3 l4)
(at p4 l1)
(at p5 l6)
(at p6 l6)
(at p7 l3)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l1 l4 level102 level6 level108)
   deleted: (at t0 l1) (fuel t0 level108)
   added: (at t0 l4) (fuel t0 level102)
   goals met: 0 of 8
2. (load p7 t0 l4)
   deleted: (at p7 l4)
   added: (in p7 t0)
   goals met: 0 of 8
3. (drive t0 l4 l3 level79 level23 level102)
   deleted: (at t0 l4) (fuel t0 level102)
   added: (at t0 l3) (fuel t0 level79)
   goals met: 0 of 8
4. (unload p7 t0 l3)
   deleted: (in p7 t0)
   added: (at p7 l3)
   goals met: 1 of 8
5. (load p4 t0 l3)
   deleted: (at p4 l3)
   added: (in p4 t0)
   goals met: 1 of 8
6. (load p3 t0 l3)
   deleted: (at p3 l3)
   added: (in p3 t0)
   goals met: 1 of 8
7. (drive t0 l3 l0 level72 level7 level79)
   deleted: (at t0 l3) (fuel t0 level79)
   added: (at t0 l0) (fuel t0 level72)
   goals met: 1 of 8
8. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 1 of 8
9. (drive t0 l0 l2 level51 level21 level72)
   deleted: (at t0 l0) (fuel t0 level72)
   added: (at t0 l2) (fuel t0 level51)
   goals met: 1 of 8
10. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 1 of 8
11. (drive t0 l2 l5 level50 level1 level51)
   deleted: (at t0 l2) (fuel t0 level51)
   added: (at t0 l5) (fuel t0 level50)
   goals met: 1 of 8
12. (load p2 t0 l5)
   deleted: (at p2 l5)
   added: (in p2 t0)
   goals met: 1 of 8
13. (load p6 t0 l5)
   deleted: (at p6 l5)
   added: (in p6 t0)
   goals met: 1 of 8
14. (drive t0 l5 l2 level49 level1 level50)
   deleted: (at t0 l5) (fuel t0 level50)
   added: (at t0 l2) (fuel t0 level49)
   goals met: 1 of 8
15. (drive t0 l2 l6 level48 level1 level49)
   deleted: (at t0 l2) (fuel t0 level49)
   added: (at t0 l6) (fuel t0 level48)
   goals met: 1 of 8
16. (load p0 t0 l6)
   deleted: (at p0 l6)
   added: (in p0 t0)
   goals met: 1 of 8
17. (unload p5 t0 l6)
   deleted: (in p5 t0)
   added: (at p5 l6)
   goals met: 2 of 8
18. (unload p6 t0 l6)
   deleted: (in p6 t0)
   added: (at p6 l6)
   goals met: 3 of 8
19. (drive t0 l6 l2 level47 level1 level48)
   deleted: (at t0 l6) (fuel t0 level48)
   added: (at t0 l2) (fuel t0 level47)
   goals met: 3 of 8
20. (drive t0 l2 l0 level26 level21 level47)
   deleted: (at t0 l2) (fuel t0 level47)
   added: (at t0 l0) (fuel t0 level26)
   goals met: 3 of 8
21. (drive t0 l0 l1 level11 level15 level26)
   deleted: (at t0 l0) (fuel t0 level26)
   added: (at t0 l1) (fuel t0 level11)
   goals met: 3 of 8
22. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 4 of 8
23. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 5 of 8
24. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 6 of 8
25. (drive t0 l1 l4 level5 level6 level11)
   deleted: (at t0 l1) (fuel t0 level11)
   added: (at t0 l4) (fuel t0 level5)
   goals met: 6 of 8
26. (unload p1 t0 l4)
   deleted: (in p1 t0)
   added: (at p1 l4)
   goals met: 7 of 8
27. (unload p3 t0 l4)
   deleted: (in p3 t0)
   added: (at p3 l4)
   goals met: 8 of 8
